{
  "source_type": "weekly-plan",
  "theme": "You've Got a Friend in Me",
  "week_range": "September 22-26",
  "books": [
    "Frog and Toad Are Friends by Arnold Lobel",
    "The Rainbow Fish by Marcus Pfister",
    "I've Got a Best Friend by Karl Edwards",
    "Walter Had a Best Friend by Deborah Underwood",
    "Strictly No Elephants by Lisa Mantchev"
  ],
  "letters_numbers": [
    "Letter E: Building with wooden pieces",
    "Letter T: Introduction with objects starting with T",
    "Letter I: Wet-Dry-Try tracing activity",
    "Letter J: Writing practice"
  ],
  "activities": [
    "Play hide and seek at the park",
    "Build friendship towers with blocks",
    "Make friendship bracelets with beads and pipe cleaners",
    "Draw friend portraits",
    "Create handprint art",
    "Paint with a friend using shapes and colors",
    "Design a friendship quilt square",
    "Make a friend collage with magazine pictures",
    "Friend fingerprint activity with stamp pads",
    "Play 'Help the Doll Find His Friends' game",
    "Color mixing activity",
    "Play 'I Pick, You Pick' with cards and dice",
    "Fill the bus with friends using counting and dice"
  ],
  "focus_skills": [
    "Cooperation during group activities",
    "Fine motor skills with art and crafts",
    "Letter recognition and tracing",
    "Counting and number sets",
    "Self-expression through art"
  ],
  "sensory": [
    "Rice and small houses in the sensory table"
  ],
  "raw_excerpt": "CHICAGO CONTEMPORARY PRESCHOOL Classroom: Pre-K Week of: September 22-26 Weekly Theme: You've Got a Friend in Me. Books: Frog and Toad Are Friends by Arnold Lobel, The Rainbow Fish by Marcus Pfister, I've Got a Best Friend by Karl Edwards, Walter Had a Best Friend by Deborah Underwood, Strictly No Elephants by Lisa Mantchev. Activities: Hide and seek, friendship towers, friendship bracelets, friend portraits, handprint art, painting with shapes, friendship quilt, friend collage, fingerprint activity, Help the Doll Find His Friends game, color mixing, I Pick You Pick game, Fill the Bus with Friends. Sensory table: rice and small houses."
}